&НаКлиенте
Процедура ИмяФайлаПолеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьНаСервере(Файл)
	ТЗ = Новый ТаблицаЗначений;
	ТекстовыйФайл = Файл;
	
	Шапка = ТекстовыйФайл.ПолучитьСтроку(1);
	Разделитель = ";";
	
	МассивКолонок = СтрРазделить(Шапка,Разделитель);
	Для Каждого ИмяСтолбца Из МассивКолонок Цикл
		ИмяБезПробелов = СтрЗаменить(ИмяСтолбца," ",""); 
		ТЗ.Колонки.Добавить(ИмяБезПробелов,,ИмяСтолбца);
	КонецЦикла;
	
	Для НомерСтроки=2 по ТекстовыйФайл.КоличествоСтрок() Цикл
		Строка = ТекстовыйФайл.ПолучитьСтроку(НомерСтроки);
		МассивКолонок = СтрРазделить(Строка,Разделитель);
		НоваяСтрока = ТЗ.Добавить();
		Для НомерСтолбца = 1 по МассивКолонок.Количество() Цикл 
			ТекущееЗначение = МассивКолонок[НомерСтолбца-1];
			ИмяКолонки = ТЗ.Колонки[НомерСтолбца-1].Имя;
			НоваяСтрока[ИмяКолонки] = ТекущееЗначение;
		КонецЦикла;
	КонецЦикла;
	
	//Импорт записей о бронировании
	Если ТипИмпортаДанных = "Бронирования" Тогда
		
		НаборЗаписей = РегистрыСведений.Бронирования.СоздатьНаборЗаписей();
		Для Каждого СтрокаТД ИЗ ТЗ Цикл
			
			//Если РегистрыСведений.Бронирования.ВыбратьПоРегистратору(СтрокаТД.НомерБрони) = РегистрыСведений.Бронирования.ПустойКлюч() Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.НомерБрони                 = СтрокаТД.НомерБрони;
				НоваяЗапись.ФИО                        = СтрокаТД.ФИО;
				НоваяЗапись.ДатаЗаезда                 = Дата(Прав(СтрокаТД.ДатаЗаезда,4),Прав(Лев(СтрокаТД.ДатаЗаезда,5),2),Лев(СтрокаТД.ДатаЗаезда,2));
				НоваяЗапись.Номер                      = СтрокаТД.Номер;
				НоваяЗапись.КоличествоДней             = СтрокаТД.КолвоДней;
				НоваяЗапись.КоличествоНочей            = СтрокаТД.КолвоНочей;
				НоваяЗапись.СтоимостьЗаНочь            = СтрЗаменить(СтрокаТД.СтоимостьЗаНочь, " ","");
				НоваяЗапись.ОбщаяСтоимостьБронирования = СтрокаТД.ОбщаяСтоимостьБронирования;
				НоваяЗапись.ТипПитания                 = СтрокаТД.ТипПитания;
				Если Справочники.Отели.НайтиПоНаименованию(СтрокаТД.НаименованиеОтеля) = Справочники.Отели.ПустаяСсылка() Тогда 
					Отель = Справочники.Отели.СоздатьЭлемент();
					Отель.Наименование = СтрЗаменить(СтрокаТД.НаименованиеОтеля,"""","");
					Отель.Записать();
					НоваяЗапись.Отель = Отель;
				Иначе
					НоваяЗапись.Отель = Справочники.Отели.НайтиПоНаименованию(СтрокаТД.НаименованиеОтеля);
				КонецЕсли;
				
				
			//КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
	//Импорт записей об отелях	
	ИначеЕсли ТипИмпортаДанных = "Отели" Тогда	
		
		Для Каждого СтрокаТД ИЗ ТЗ Цикл
			Если Справочники.Отели.НайтиПоНаименованию(СтрокаТД.НазваниеОтеля) = Справочники.Отели.ПустаяСсылка() Тогда
				Отель = Справочники.Отели.СоздатьЭлемент();
				Отель.Наименование = СтрЗаменить(СтрокаТД.НазваниеОтеля,"""","");
				Отель.Звезды = СтрокаТД.Звезды;
				Отель.Мест = СтрокаТД.Мест;
				Отель.Адрес = СтрокаТД.Адрес;
				Если Справочники.Страны.НайтиПоНаименованию(СтрокаТД.Страна) = Справочники.Страны.ПустаяСсылка() Тогда 
					Страна = Справочники.Страны.СоздатьЭлемент();
					Страна.Наименование = СтрокаТД.Страна;
					Страна.Записать();
					Отель.Страна = Страна;
				Иначе
					Отель.Страна = Справочники.Страны.НайтиПоНаименованию(СтрокаТД.Страна);
				КонецЕсли;
				Отель.Парковок = СтрокаТД.Парковок;
				Отель.Трансфер = СтрокаТД.Трансфер;
				Отель.Записать();
			КонецЕсли;
		КонецЦикла;                         
	//Импорт данных о договорах	
	ИначеЕсли ТипИмпортаДанных = "Договоры" Тогда	
		
		Для Каждого СтрокаТД ИЗ ТЗ Цикл
			Если Документы.Договоры.НайтиПоНомеру(СтрокаТД.НомерДоговора) <> Документы.Договоры.ПустаяСсылка() Тогда
				ДокументСсылка = Документы.Договоры.НайтиПоНомеру(СтрокаТД.НомерДоговора);
				Документ = ДокументСсылка.ПолучитьОбъект();
				Документ.Номер = СтрокаТД.НомерДоговора;
				Документ.Дата = ТекущаяДата();
				Документ.СтоимостьДоговора = СтрЗаменить(СтрокаТД.СтоимостьДоговора," $","");
				Документ.ДатаПодписания = Дата(Прав(СтрокаТД.ДатаПодписания,4),Прав(Лев(СтрокаТД.ДатаПодписания,5),2),Лев(СтрокаТД.ДатаПодписания,2));
				Если Справочники.Страны.НайтиПоНаименованию(СтрокаТД.СтранаОтправления) = Справочники.Страны.ПустаяСсылка() Тогда 
					Страна = Справочники.Страны.СоздатьЭлемент();
					Страна.Наименование = СтрокаТД.СтранаОтправления;
					Страна.Записать();
					Документ.СтранаОтправления = Страна;
				Иначе
					Документ.СтранаОтправления = Справочники.Страны.НайтиПоНаименованию(СтрокаТД.СтранаОтправления);
				КонецЕсли;
				Если Справочники.Отели.НайтиПоНаименованию(СтрокаТД.Отель) = Справочники.Отели.ПустаяСсылка() Тогда 
					Отель = Справочники.Отели.СоздатьЭлемент();
					Отель.Наименование = СтрокаТД.Отель;
					Отель.Записать();
					Документ.Отель = Отель;
				Иначе
					Документ.Отель = Справочники.Отели.НайтиПоНаименованию(СтрокаТД.Отель);
				КонецЕсли;
				Документ.Записать();
			КонецЕсли;
		КонецЦикла;
	//Импорт данных о туристах	
	ИначеЕсли ТипИмпортаДанных = "Туристы" Тогда	
		
		Для Каждого СтрокаТД ИЗ ТЗ Цикл
			Если Справочники.Туристы.НайтиПоРеквизиту("ФИО",СтрокаТД.фио) = Справочники.Туристы.ПустаяСсылка() Тогда
				Турист = Справочники.Туристы.СоздатьЭлемент();
				Турист.ФИО = СтрокаТД.фио;
				Паспорт = СтрЗаменить(СтрокаТД.паспорт,"-","");
				Паспорт = СтрЗаменить(СтрокаТД.паспорт,"""","");
				Паспорт = СтрЗаменить(СтрокаТД.паспорт," ","");
				Турист.Паспорт = Паспорт;
				Телефон = СтрЗаменить(СтрокаТД.телефон," ","");
				Телефон = СтрЗаменить(СтрокаТД.телефон,"""","");
				Телефон = СтрЗаменить(СтрокаТД.телефон,"+","");
				Телефон = СтрЗаменить(СтрокаТД.телефон,"(","");
				Телефон = СтрЗаменить(СтрокаТД.телефон,")","");
				Телефон = СтрЗаменить(СтрокаТД.телефон,"-","");
				Телефон = СтрЗаменить(СтрокаТД.телефон,":","");
				Турист.Телефон = Телефон;
				Турист.Email = СтрокаТД.емейл;  
				Турист.Регистрация = Дата(Прав(СтрокаТД.регистрация,4),Прав(Лев(СтрокаТД.регистрация,5),2),Лев(СтрокаТД.регистрация,2));
				Турист.СтраховойПолис = СтрокаТД.страховойполис;
				Турист.ЗагранПаспорт = СтрокаТД.загранпаспорт;
				Пол = СтрокаТД.пол;
				Если СтрНачинаетсяС(Пол,"м") ИЛИ СтрНачинаетсяС(Пол,"М") ИЛИ СтрНачинаетсяС(Пол,"m") Тогда
					Турист.Пол = "M";
				ИначеЕсли СтрНачинаетсяС(Пол,"ж") ИЛИ СтрНачинаетсяС(Пол,"Ж") ИЛИ СтрНачинаетсяС(Пол,"f") Тогда
					Турист.Пол = "F";
				КонецЕсли;
				Турист.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Импортировать(Команда)
	
	ПрочитанныйФайл = Новый ТекстовыйДокумент;
	ПрочитанныйФайл.Прочитать(ИмяФайла);
	ИмпортироватьНаСервере(ПрочитанныйФайл);
КонецПроцедуры
