
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
	
	ТабДок = Новый ТабличныйДокумент;
	МакетНачальный = Обработки.Избранное.ПолучитьМакет("МакетНачальный");
	ОбластьПоля = МакетНачальный.ПолучитьОбласть("ОбластьПоля");
	ТабДок.Вывести(ОбластьПоля);
	ТабИзбр.Присоединить(ТабДок);
	Макет = Обработки.Избранное.ПолучитьМакет("Макет");
	
	
	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Избранное.Тур.Наименование КАК ТурНаименование,
	|	Избранное.Стоимость КАК Стоимость,
	|	Избранное.Отель.Наименование КАК ОтельНаименование,
	|	Избранное.Звезды КАК Звезды,
	|	Избранное.ДопУслуги КАК ДопУслуги,
	|	Избранное.Даты КАК Даты,
	|	Избранное.Тур.Отель.Страна КАК ТурОтельСтрана,
	|	Избранное.КолвоЧеловек КАК КолвоЧеловек
	|ИЗ
	|	РегистрСведений.Избранное КАК Избранное";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Счетчик = 1;
		ОбластьПараметры = Макет.ПолучитьОбласть("ОбластьПараметры");
		ОбластьПараметры.Параметры.Тур = Выборка.ТурНаименование;
		ОбластьПараметры.Параметры.Стоимость = Выборка.Стоимость;
		КолвоЗвезд = "";
		Для Звезды=0 По Выборка.Звезды-1 Цикл
			КолвоЗвезд = КолвоЗвезд+"*";
		КонецЦикла;
		ОбластьПараметры.Параметры.Отель = КолвоЗвезд;
		ОбластьПараметры.Параметры.ДопУслуги = Выборка.ДопУслуги;
		ОбластьПараметры.Параметры.Даты = Выборка.Даты;
		
		СтруктураРасшифровки = Новый Структура;
		СтруктураРасшифровки.Вставить("Тур",Выборка.ТурНаименование);
		СтруктураРасшифровки.Вставить("Страна",Выборка.ТурОтельСтрана);
		СтруктураРасшифровки.Вставить("Стоимость",Выборка.Стоимость);
		СтруктураРасшифровки.Вставить("Звезды",Выборка.Звезды);
		СтруктураРасшифровки.Вставить("Отель",Выборка.ОтельНаименование);
		СтруктураРасшифровки.Вставить("Даты",Выборка.Даты);
		СтруктураРасшифровки.Вставить("КолвоЧеловек", Выборка.КолвоЧеловек);
		
		ОбластьПараметры.Параметры.РасшифровкаЯчейки = СтруктураРасшифровки;
		
		ТабДок.Очистить();
		ТабДок.Вывести(ОбластьПараметры);
		ТабИзбр.Присоединить(ТабДок);
		
	КонецЦикла;
	
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ТабИзбрОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.Бронирование.Форма.Форма",Расшифровка);

КонецПроцедуры
