//WS-Ссылка пример: http://www.cbr.ru/DailyInfoWebServ/DailyInfo.asmx?WSDL

Процедура ЗагрузитьКурсыВалют(фДатаЗагрузки)
  Прокси = WSСсылки.WSСсылка1.СоздатьWSПрокси("http://web.cbr.ru/", "DailyInfo", "DailyInfoSoap");

      ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить("http://web.cbr.ru/").Получить("GetCursOnDate");

      WSПараметр  = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);

      WSПараметр.On_Date= фДатаЗагрузки;

      КурсыВалют = Прокси.GetCursOnDate(WSПараметр);

      Для Каждого Элемент Из КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate Цикл 

          НоваяСтрокаТЗ = ТаблицаКурсовВалют.Добавить();

          НоваяСтрокаТЗ.НазваниеВалюты      = Элемент.Vname;

          НоваяСтрокаТЗ.Номинал             = Элемент.Vnom;

          НоваяСтрокаТЗ.ЦифровойКодВалюты   = Элемент.Vcode;

          НоваяСтрокаТЗ.СимвольныйКодВалюты = Элемент.VChCode;

          НоваяСтрокаТЗ.КурсВалюты          = Элемент.Vcurs;

      КонецЦикла;
КонецПроцедуры      
